Microchip-MPLAB-Harmony/csp/apps/systick/systick_periodic_timeout/firmware/src/packs/ATSAML10E16A_DFP/atsaml10e16a.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* Cortex-M handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault */
  void* pvReservedC12;
  void* pvReservedC11;
  void* pvReservedC10;
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction */
  void* pvReservedC4;
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer */

  /* Peripheral handlers */
  void* pfnSYSTEM_Handler;                       /*   0 System peripherals shared interrupt (MCLK OSCCTRL OSC32KCTRL PM SUPC) */
  void* pfnWDT_Handler;                          /*   1 Watchdog Timer (WDT) */
  void* pfnRTC_Handler;                          /*   2 Real-Time Counter (RTC) */
  void* pfnEIC_0_Handler;                        /*   3 External Interrupt Controller (EIC) */
  void* pfnEIC_1_Handler;                        /*   4 External Interrupt Controller (EIC) */
  void* pfnEIC_2_Handler;                        /*   5 External Interrupt Controller (EIC) */
  void* pfnEIC_3_Handler;                        /*   6 External Interrupt Controller (EIC) */
  void* pfnEIC_OTHER_Handler;                    /*   7 External Interrupt Controller (EIC) */
  void* pfnFREQM_Handler;                        /*   8 Frequency Meter (FREQM) */
  void* pfnNVMCTRL_Handler;                      /*   9 Non-Volatile Memory Controller (NVMCTRL) */
  void* pfnPORT_Handler;                         /*  10 Port Module (PORT) */
  void* pfnDMAC_0_Handler;                       /*  11 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_1_Handler;                       /*  12 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_2_Handler;                       /*  13 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_3_Handler;                       /*  14 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_OTHER_Handler;                   /*  15 Direct Memory Access Controller (DMAC) */
  void* pfnEVSYS_0_Handler;                      /*  16 Event System Interface (EVSYS) */
  void* pfnEVSYS_1_Handler;                      /*  17 Event System Interface (EVSYS) */
  void* pfnEVSYS_2_Handler;                      /*  18 Event System Interface (EVSYS) */
  void* pfnEVSYS_3_Handler;                      /*  19 Event System Interface (EVSYS) */
  void* pfnEVSYS_NSCHK_Handler;                  /*  20 Event System Interface (EVSYS) */
  void* pfnPAC_Handler;                          /*  21 Peripheral Access Controller (PAC) */
  void* pfnSERCOM0_0_Handler;                    /*  22 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_1_Handler;                    /*  23 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_2_Handler;                    /*  24 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_OTHER_Handler;                /*  25 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM1_0_Handler;                    /*  26 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_1_Handler;                    /*  27 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_2_Handler;                    /*  28 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_OTHER_Handler;                /*  29 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM2_0_Handler;                    /*  30 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_1_Handler;                    /*  31 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_2_Handler;                    /*  32 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_OTHER_Handler;                /*  33 Serial Communication Interface (SERCOM2) */
  void* pfnTC0_Handler;                          /*  34 Basic Timer Counter (TC0) */
  void* pfnTC1_Handler;                          /*  35 Basic Timer Counter (TC1) */
  void* pfnTC2_Handler;                          /*  36 Basic Timer Counter (TC2) */
  void* pfnADC_OTHER_Handler;                    /*  37 Analog Digital Converter (ADC) */
  void* pfnADC_RESRDY_Handler;                   /*  38 Analog Digital Converter (ADC) */
  void* pfnAC_Handler;                           /*  39 Analog Comparators (AC) */
  void* pfnDAC_UNDERRUN_A_Handler;               /*  40 Digital Analog Converter (DAC) */
  void* pfnDAC_EMPTY_Handler;                    /*  41 Digital Analog Converter (DAC) */
  void* pfnPTC_Handler;                          /*  42 Peripheral Touch Controller (PTC) */
  void* pfnTRNG_Handler;                         /*  43 True Random Generator (TRNG) */
  void* pfnTRAM_Handler;                         /*  44 TrustRAM (TRAM) */
} DeviceVectors;

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M23 exception handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void SVCall_Handler                ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void SYSTEM_Handler                ( void );
void WDT_Handler                   ( void );
void RTC_Handler                   ( void );
void EIC_0_Handler                 ( void );
void EIC_1_Handler                 ( void );
void EIC_2_Handler                 ( void );
void EIC_3_Handler                 ( void );
void EIC_OTHER_Handler             ( void );
void FREQM_Handler                 ( void );
void NVMCTRL_Handler               ( void );
void PORT_Handler                  ( void );
void DMAC_0_Handler                ( void );
void DMAC_1_Handler                ( void );
void DMAC_2_Handler                ( void );
void DMAC_3_Handler                ( void );
void DMAC_OTHER_Handler            ( void );
void EVSYS_0_Handler               ( void );
void EVSYS_1_Handler               ( void );
void EVSYS_2_Handler               ( void );
void EVSYS_3_Handler               ( void );
void EVSYS_NSCHK_Handler           ( void );
void PAC_Handler                   ( void );
void SERCOM0_0_Handler             ( void );
void SERCOM0_1_Handler             ( void );
void SERCOM0_2_Handler             ( void );
void SERCOM0_OTHER_Handler         ( void );
void SERCOM1_0_Handler             ( void );
void SERCOM1_1_Handler             ( void );
void SERCOM1_2_Handler             ( void );
void SERCOM1_OTHER_Handler         ( void );
void SERCOM2_0_Handler             ( void );
void SERCOM2_1_Handler             ( void );
void SERCOM2_2_Handler             ( void );
void SERCOM2_OTHER_Handler         ( void );
void TC0_Handler                   ( void );
void TC1_Handler                   ( void );
void TC2_Handler                   ( void );
void ADC_OTHER_Handler             ( void );
void ADC_RESRDY_Handler            ( void );
void AC_Handler                    ( void );
void DAC_UNDERRUN_A_Handler        ( void );
void DAC_EMPTY_Handler             ( void );
void PTC_Handler                   ( void );
void TRNG_Handler                  ( void );
void TRAM_Handler                  ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

